endurancehtml/statistics.json
{
  "Check jmeter variables for tasklist id" : {
    "transaction" : "Check jmeter variables for tasklist id",
    "sampleCount" : 26249,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.0073907577431520915,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 131.71852810855023,
    "receivedKBytesPerSec" : 43.11902657240279,
    "sentKBytesPerSec" : 0.0
  },
  "Check if task is created" : {
    "transaction" : "Check if task is created",
    "sampleCount" : 26241,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.007278686025685044,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 131.67970533774258,
    "receivedKBytesPerSec" : 43.126236684811246,
    "sentKBytesPerSec" : 0.0
  },
  "TaskUpdate" : {
    "transaction" : "TaskUpdate",
    "sampleCount" : 26203,
    "errorCount" : 5933,
    "errorPct" : 22.642445,
    "meanResTime" : 49.67862458497113,
    "medianResTime" : 18.0,
    "minResTime" : 0.0,
    "maxResTime" : 2267.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 181.0,
    "pct3ResTime" : 447.9700000000048,
    "throughput" : 131.49825609113492,
    "receivedKBytesPerSec" : 95.86693500959778,
    "sentKBytesPerSec" : 24.842267010952753
  },
  "Check if Id hasnt updated" : {
    "transaction" : "Check if Id hasnt updated",
    "sampleCount" : 26197,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.007290911173035066,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 131.47012476036574,
    "receivedKBytesPerSec" : 43.086062766922446,
    "sentKBytesPerSec" : 0.0
  },
  "TaskListUpdate" : {
    "transaction" : "TaskListUpdate",
    "sampleCount" : 26208,
    "errorCount" : 10312,
    "errorPct" : 39.346764,
    "meanResTime" : 49.15678418803379,
    "medianResTime" : 19.0,
    "minResTime" : 0.0,
    "maxResTime" : 1332.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 176.0,
    "pct3ResTime" : 453.9900000000016,
    "throughput" : 131.5220282334757,
    "receivedKBytesPerSec" : 98.2056316478017,
    "sentKBytesPerSec" : 24.32185934104744
  },
  "TaskListReadAll" : {
    "transaction" : "TaskListReadAll",
    "sampleCount" : 26241,
    "errorCount" : 5936,
    "errorPct" : 22.62109,
    "meanResTime" : 73.44441903890852,
    "medianResTime" : 52.0,
    "minResTime" : 0.0,
    "maxResTime" : 1834.0,
    "pct1ResTime" : 208.90000000000146,
    "pct2ResTime" : 309.0,
    "pct3ResTime" : 674.9800000000032,
    "throughput" : 131.62488337797572,
    "receivedKBytesPerSec" : 1435.5763538030067,
    "sentKBytesPerSec" : 18.92864409340797
  },
  "TaskDelete" : {
    "transaction" : "TaskDelete",
    "sampleCount" : 26181,
    "errorCount" : 5977,
    "errorPct" : 22.829533,
    "meanResTime" : 49.40006111302073,
    "medianResTime" : 20.0,
    "minResTime" : 0.0,
    "maxResTime" : 1398.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 180.0,
    "pct3ResTime" : 456.9800000000032,
    "throughput" : 131.38916908808963,
    "receivedKBytesPerSec" : 85.44378123227844,
    "sentKBytesPerSec" : 21.213547900576124
  },
  "Check if id hasn't updated" : {
    "transaction" : "Check if id hasn't updated",
    "sampleCount" : 26203,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.008701293744991035,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 131.49891601092017,
    "receivedKBytesPerSec" : 43.27977739330737,
    "sentKBytesPerSec" : 0.0
  },
  "TaskList Delete" : {
    "transaction" : "TaskList Delete",
    "sampleCount" : 26197,
    "errorCount" : 8173,
    "errorPct" : 31.198229,
    "meanResTime" : 113.62316295759032,
    "medianResTime" : 31.0,
    "minResTime" : 0.0,
    "maxResTime" : 3438.0,
    "pct1ResTime" : 251.0,
    "pct2ResTime" : 1051.9000000000015,
    "pct3ResTime" : 1565.9900000000016,
    "throughput" : 131.46880520314758,
    "receivedKBytesPerSec" : 86.95778786245884,
    "sentKBytesPerSec" : 21.654615743749495
  },
  "TaskListCreate" : {
    "transaction" : "TaskListCreate",
    "sampleCount" : 26258,
    "errorCount" : 5961,
    "errorPct" : 22.701653,
    "meanResTime" : 50.49478254246337,
    "medianResTime" : 24.0,
    "minResTime" : 0.0,
    "maxResTime" : 1648.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 178.0,
    "pct3ResTime" : 429.9800000000032,
    "throughput" : 131.7213875442073,
    "receivedKBytesPerSec" : 98.21164313125486,
    "sentKBytesPerSec" : 23.76426840872608
  },
  "TaskReadAll" : {
    "transaction" : "TaskReadAll",
    "sampleCount" : 26212,
    "errorCount" : 5893,
    "errorPct" : 22.482069,
    "meanResTime" : 52.13696017091395,
    "medianResTime" : 23.0,
    "minResTime" : 0.0,
    "maxResTime" : 1394.0,
    "pct1ResTime" : 141.0,
    "pct2ResTime" : 201.0,
    "pct3ResTime" : 486.9800000000032,
    "throughput" : 131.54210180310838,
    "receivedKBytesPerSec" : 262.94990280001207,
    "sentKBytesPerSec" : 18.537157431988238
  },
  "TaskCreate" : {
    "transaction" : "TaskCreate",
    "sampleCount" : 26249,
    "errorCount" : 5933,
    "errorPct" : 22.602766,
    "meanResTime" : 48.78662044268333,
    "medianResTime" : 20.0,
    "minResTime" : 0.0,
    "maxResTime" : 1821.0,
    "pct1ResTime" : 139.0,
    "pct2ResTime" : 177.95000000000073,
    "pct3ResTime" : 442.0,
    "throughput" : 131.71852810855023,
    "receivedKBytesPerSec" : 96.3595130352994,
    "sentKBytesPerSec" : 23.49548188236711
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 314639,
    "errorCount" : 54118,
    "errorPct" : 17.20003,
    "meanResTime" : 40.55798550084404,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 3438.0,
    "pct1ResTime" : 279.0,
    "pct2ResTime" : 403.0,
    "pct3ResTime" : 751.9900000000016,
    "throughput" : 1577.6993315916943,
    "receivedKBytesPerSec" : 2430.9358785739537,
    "sentKBytesPerSec" : 176.63321850288824
  }
}