html/statistics.json
{
  "Check jmeter variables for tasklist id" : {
    "transaction" : "Check jmeter variables for tasklist id",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.09200000000000026,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16.78049435336365,
    "receivedKBytesPerSec" : 4.797730149723961,
    "sentKBytesPerSec" : 0.0
  },
  "Check if task is created" : {
    "transaction" : "Check if task is created",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.010999999999999992,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16.782184033430113,
    "receivedKBytesPerSec" : 4.994240301995402,
    "sentKBytesPerSec" : 0.0
  },
  "TaskUpdate" : {
    "transaction" : "TaskUpdate",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.1030000000000002,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 16.784719191647923,
    "receivedKBytesPerSec" : 4.851832891335728,
    "sentKBytesPerSec" : 4.065049179227231
  },
  "Check if Id hasnt updated" : {
    "transaction" : "Check if Id hasnt updated",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.015000000000000005,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16.78753693258125,
    "receivedKBytesPerSec" : 4.996030009820709,
    "sentKBytesPerSec" : 0.0
  },
  "TaskListUpdate" : {
    "transaction" : "TaskListUpdate",
    "sampleCount" : 1000,
    "errorCount" : 2,
    "errorPct" : 0.2,
    "meanResTime" : 1.038000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.783029001074116,
    "receivedKBytesPerSec" : 4.984494054611976,
    "sentKBytesPerSec" : 3.9826914524033294
  },
  "TaskListReadAll" : {
    "transaction" : "TaskListReadAll",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.836000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.782184033430113,
    "receivedKBytesPerSec" : 5.04040769693893,
    "sentKBytesPerSec" : 3.1138818030778523
  },
  "TaskDelete" : {
    "transaction" : "TaskDelete",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9960000000000006,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.78838243935197,
    "receivedKBytesPerSec" : 3.1314268026525647,
    "sentKBytesPerSec" : 3.475719801897087
  },
  "Check if id hasn't updated" : {
    "transaction" : "Check if id hasn't updated",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.016,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 1.0,
    "throughput" : 16.78500092317505,
    "receivedKBytesPerSec" : 4.995980123411719,
    "sentKBytesPerSec" : 0.0
  },
  "TaskList Delete" : {
    "transaction" : "TaskList Delete",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0739999999999994,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.787255115915997,
    "receivedKBytesPerSec" : 3.1312165304101125,
    "sentKBytesPerSec" : 3.5410616260135304
  },
  "TaskListCreate" : {
    "transaction" : "TaskListCreate",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7060000000000015,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 4.0,
    "throughput" : 16.731081329786342,
    "receivedKBytesPerSec" : 4.967039769780321,
    "sentKBytesPerSec" : 3.905008240057555
  },
  "TaskReadAll" : {
    "transaction" : "TaskReadAll",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.7419999999999998,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.78274733573886,
    "receivedKBytesPerSec" : 4.75876111857011,
    "sentKBytesPerSec" : 3.0484287152806915
  },
  "TaskCreate" : {
    "transaction" : "TaskCreate",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8960000000000006,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 1.0,
    "pct3ResTime" : 2.0,
    "throughput" : 16.780775943079608,
    "receivedKBytesPerSec" : 4.71959323399114,
    "sentKBytesPerSec" : 3.8674444556316283
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 12000,
    "errorCount" : 2,
    "errorPct" : 0.016666668,
    "meanResTime" : 0.7104166666666639,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 1.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 200.74946466809422,
    "receivedKBytesPerSec" : 55.204027980502204,
    "sentKBytesPerSec" : 28.916548865765524
  }
}