stresshtml/statistics.json
{
  "Check jmeter variables for tasklist id" : {
    "transaction" : "Check jmeter variables for tasklist id",
    "sampleCount" : 15602,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.008139982053582835,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 174.12557755407246,
    "receivedKBytesPerSec" : 58.16629546494497,
    "sentKBytesPerSec" : 0.0
  },
  "Check if task is created" : {
    "transaction" : "Check if task is created",
    "sampleCount" : 15589,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.008082622361921843,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 173.984375,
    "receivedKBytesPerSec" : 58.13000270298549,
    "sentKBytesPerSec" : 0.0
  },
  "TaskUpdate" : {
    "transaction" : "TaskUpdate",
    "sampleCount" : 15533,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 53.29434108028078,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 2800.0,
    "pct1ResTime" : 165.0,
    "pct2ResTime" : 311.0,
    "pct3ResTime" : 708.3199999999997,
    "throughput" : 173.36324471528383,
    "receivedKBytesPerSec" : 50.282112969179,
    "sentKBytesPerSec" : 42.15571087315007
  },
  "Check if Id hasnt updated" : {
    "transaction" : "Check if Id hasnt updated",
    "sampleCount" : 15520,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.00844072164948456,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 173.2220188401268,
    "receivedKBytesPerSec" : 57.87515974485468,
    "sentKBytesPerSec" : 0.0
  },
  "TaskListUpdate" : {
    "transaction" : "TaskListUpdate",
    "sampleCount" : 15548,
    "errorCount" : 2846,
    "errorPct" : 18.304605,
    "meanResTime" : 53.01189863648057,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 2628.0,
    "pct1ResTime" : 162.0,
    "pct2ResTime" : 312.0,
    "pct3ResTime" : 684.0200000000004,
    "throughput" : 173.528722418777,
    "receivedKBytesPerSec" : 53.60732916592261,
    "sentKBytesPerSec" : 41.348640888849204
  },
  "TaskListReadAll" : {
    "transaction" : "TaskListReadAll",
    "sampleCount" : 15589,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 79.82070690871804,
    "medianResTime" : 16.0,
    "minResTime" : 5.0,
    "maxResTime" : 2282.0,
    "pct1ResTime" : 234.0,
    "pct2ResTime" : 359.0,
    "pct3ResTime" : 743.2000000000007,
    "throughput" : 173.9688420676725,
    "receivedKBytesPerSec" : 1700.9084119337838,
    "sentKBytesPerSec" : 32.27937499302517
  },
  "TaskDelete" : {
    "transaction" : "TaskDelete",
    "sampleCount" : 15505,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 49.2109642050952,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 2490.0,
    "pct1ResTime" : 150.0,
    "pct2ResTime" : 291.6999999999989,
    "pct3ResTime" : 632.0,
    "throughput" : 173.08937462323337,
    "receivedKBytesPerSec" : 32.28522514945076,
    "sentKBytesPerSec" : 36.00394218237179
  },
  "Check if id hasn't updated" : {
    "transaction" : "Check if id hasn't updated",
    "sampleCount" : 15533,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.008755552694263863,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 1.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 173.36324471528383,
    "receivedKBytesPerSec" : 58.19056019665618,
    "sentKBytesPerSec" : 0.0
  },
  "TaskList Delete" : {
    "transaction" : "TaskList Delete",
    "sampleCount" : 15520,
    "errorCount" : 1,
    "errorPct" : 0.006443299,
    "meanResTime" : 52.783569587628904,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 1872.0,
    "pct1ResTime" : 162.89999999999964,
    "pct2ResTime" : 312.0,
    "pct3ResTime" : 710.5799999999981,
    "throughput" : 173.2220188401268,
    "receivedKBytesPerSec" : 32.31169944459016,
    "sentKBytesPerSec" : 36.708181726862804
  },
  "TaskListCreate" : {
    "transaction" : "TaskListCreate",
    "sampleCount" : 15614,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.53349558088877,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 2185.0,
    "pct1ResTime" : 179.0,
    "pct2ResTime" : 310.0,
    "pct3ResTime" : 658.0,
    "throughput" : 174.13900785153461,
    "receivedKBytesPerSec" : 51.86757558077935,
    "sentKBytesPerSec" : 40.64377234034841
  },
  "TaskReadAll" : {
    "transaction" : "TaskReadAll",
    "sampleCount" : 15561,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 59.6699440909967,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 2118.0,
    "pct1ResTime" : 174.0,
    "pct2ResTime" : 319.89999999999964,
    "pct3ResTime" : 710.3799999999992,
    "throughput" : 173.66799848217673,
    "receivedKBytesPerSec" : 985.9535191911174,
    "sentKBytesPerSec" : 31.545163786801634
  },
  "TaskCreate" : {
    "transaction" : "TaskCreate",
    "sampleCount" : 15602,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 56.41885655685167,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 2160.0,
    "pct1ResTime" : 184.0,
    "pct2ResTime" : 325.0,
    "pct3ResTime" : 671.9399999999987,
    "throughput" : 174.12557755407246,
    "receivedKBytesPerSec" : 49.142863196413025,
    "sentKBytesPerSec" : 40.13050420191514
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 186716,
    "errorCount" : 2847,
    "errorPct" : 1.5247756,
    "meanResTime" : 38.48738726193808,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2800.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 409.0,
    "throughput" : 2082.0481941145645,
    "receivedKBytesPerSec" : 3186.1099183441775,
    "sentKBytesPerSec" : 300.57190960258254
  }
}